## pandas

- series

In [3]:
book_title = ['C++', 'Java', 'Python', 'JavaScript']

In [6]:
book_title=pd.Series(book_title)
book_title

0           C++
1          Java
2        Python
3    JavaScript
dtype: object

In [7]:
book_title[2]

'Python'

In [10]:
book_title.index=['a','b','c','d']

In [11]:
book_title

a           C++
b          Java
c        Python
d    JavaScript
dtype: object

###  dataframe

In [12]:
arr=np.random.randint(10,100,(6,4))

In [13]:
arr

array([[52, 56, 14, 79],
       [61, 87, 53, 61],
       [79, 92, 45, 11],
       [51, 51, 74, 37],
       [72, 71, 83, 29],
       [31, 73, 88, 32]])

In [14]:
df=pd.DataFrame(data=arr)
df

    0   1   2   3
0  52  56  14  79
1  61  87  53  61
2  79  92  45  11
3  51  51  74  37
4  72  71  83  29
5  31  73  88  32

In [15]:
df[2]

0    14
1    53
2    45
3    74
4    83
5    88
Name: 2, dtype: int32

In [18]:
df.columns=['A','B','C','D']
df

    A   B   C   D
0  52  56  14  79
1  61  87  53  61
2  79  92  45  11
3  51  51  74  37
4  72  71  83  29
5  31  73  88  32

In [19]:
df['D']

0    79
1    61
2    11
3    37
4    29
5    32
Name: D, dtype: int32

In [20]:
df.shape

(6, 4)

In [22]:
df.head(3)

    A   B   C   D
0  52  56  14  79
1  61  87  53  61
2  79  92  45  11

In [24]:
df.tail(2)

    A   B   C   D
4  72  71  83  29
5  31  73  88  32

In [25]:
df['C']

0    14
1    53
2    45
3    74
4    83
5    88
Name: C, dtype: int32

In [26]:
cols=['A','B']
df[cols]

    A   B
0  52  56
1  61  87
2  79  92
3  51  51
4  72  71
5  31  73

In [27]:
df[['A','B']]

    A   B
0  52  56
1  61  87
2  79  92
3  51  51
4  72  71
5  31  73

In [28]:
df[['B', 'D', 'A']]

    B   D   A
0  56  79  52
1  87  61  61
2  92  11  79
3  51  37  51
4  71  29  72
5  73  32  31

In [31]:
df['A+B']=df['A']+df['B']

In [32]:
df

    A   B   C   D   AB  A+B
0  52  56  14  79  108  108
1  61  87  53  61  148  148
2  79  92  45  11  171  171
3  51  51  74  37  102  102
4  72  71  83  29  143  143
5  31  73  88  32  104  104

In [33]:
df.drop(columns=['AB'],inplace=True)

In [34]:
df

    A   B   C   D  A+B
0  52  56  14  79  108
1  61  87  53  61  148
2  79  92  45  11  171
3  51  51  74  37  102
4  72  71  83  29  143
5  31  73  88  32  104

### indexing/extracting data

In [35]:
"p q r s t u".split()

['p', 'q', 'r', 's', 't', 'u']

In [37]:
df.index="p q r s t u".split()

In [38]:
df

    A   B   C   D  A+B
p  52  56  14  79  108
q  61  87  53  61  148
r  79  92  45  11  171
s  51  51  74  37  102
t  72  71  83  29  143
u  31  73  88  32  104

In [39]:
df.loc['t']

A       72
B       71
C       83
D       29
A+B    143
Name: t, dtype: int32

In [40]:
df.iloc[4]

A       72
B       71
C       83
D       29
A+B    143
Name: t, dtype: int32

In [41]:
df.iloc[2:5]

    A   B   C   D  A+B
r  79  92  45  11  171
s  51  51  74  37  102
t  72  71  83  29  143

In [42]:
df.iloc[2:5]

    A   B   C   D  A+B
r  79  92  45  11  171
s  51  51  74  37  102
t  72  71  83  29  143

In [43]:
df.iloc[2:5][['A','B']]

    A   B
r  79  92
s  51  51
t  72  71

In [44]:
df.iloc[-2:,-2:]

    D  A+B
t  29  143
u  32  104

In [45]:
df.iloc[-2:][['D', 'A+B']]

    D  A+B
t  29  143
u  32  104

- masking boolean indexing

In [46]:
df

    A   B   C   D  A+B
p  52  56  14  79  108
q  61  87  53  61  148
r  79  92  45  11  171
s  51  51  74  37  102
t  72  71  83  29  143
u  31  73  88  32  104

In [47]:
mask=df>30

In [48]:
mask

      A     B      C      D   A+B
p  True  True  False   True  True
q  True  True   True   True  True
r  True  True   True  False  True
s  True  True   True   True  True
t  True  True   True  False  True
u  True  True   True   True  True

In [49]:
df[mask]

    A   B     C     D  A+B
p  52  56   NaN  79.0  108
q  61  87  53.0  61.0  148
r  79  92  45.0   NaN  171
s  51  51  74.0  37.0  102
t  72  71  83.0   NaN  143
u  31  73  88.0  32.0  104

In [53]:
mask=df['B']>60
mask

p    False
q     True
r     True
s    False
t     True
u     True
Name: B, dtype: bool

In [54]:
df[mask]

    A   B   C   D  A+B
q  61  87  53  61  148
r  79  92  45  11  171
t  72  71  83  29  143
u  31  73  88  32  104

In [55]:
# extracting values from Col C and col D where B column has value >40
df[ df['B'] > 40 ][['C', 'D']]

    C   D
p  14  79
q  53  61
r  45  11
s  74  37
t  83  29
u  88  32

In [56]:
df[(df['A']> 40) & (df['D']<50)]

    A   B   C   D  A+B
r  79  92  45  11  171
s  51  51  74  37  102
t  72  71  83  29  143

In [57]:
# converting a dataframe to numpy array

In [58]:
df_array=df.values
df_array

array([[ 52,  56,  14,  79, 108],
       [ 61,  87,  53,  61, 148],
       [ 79,  92,  45,  11, 171],
       [ 51,  51,  74,  37, 102],
       [ 72,  71,  83,  29, 143],
       [ 31,  73,  88,  32, 104]])

In [59]:
pd.DataFrame(df_array)

    0   1   2   3    4
0  52  56  14  79  108
1  61  87  53  61  148
2  79  92  45  11  171
3  51  51  74  37  102
4  72  71  83  29  143
5  31  73  88  32  104

### iris dataset

In [2]:
iris=pd.read_csv("./iris.csv")

In [62]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [63]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [65]:
iris.shape

(150, 5)

In [66]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [67]:
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [69]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [70]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [73]:
iris['species'].nunique()

3

In [74]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [75]:
iris['species']

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [76]:
#  How many setosa flowers are there?
iris [ iris['species'] == 'setosa' ].shape

(50, 5)

In [77]:
iris['species'].value_counts()['virginica']

50

In [78]:
iris.sort_values(by=["sepal_length", "sepal_width"])

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
8             4.4          2.9           1.4          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
42            4.4          3.2           1.3          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
118           7.7          2.6           6.9          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
135           7.7          3.0           6.1          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

### group by

In [33]:
iris['species'].apply(len)

0      6
1      6
2      6
3      6
4      6
      ..
145    9
146    9
147    9
148    9
149    9
Name: species, Length: 150, dtype: int64

In [37]:
iris.apply(lambda x:x+x,axis=1)

     sepal_length  sepal_width  petal_length  petal_width             species
0            10.2          7.0           2.8          0.4        setosasetosa
1             9.8          6.0           2.8          0.4        setosasetosa
2            11.6          6.4           2.6          0.4        setosasetosa
3             9.2          6.2           3.0          0.4        setosasetosa
4            10.0          7.2           2.8          0.4        setosasetosa
..            ...          ...           ...          ...                 ...
145          11.6          6.0          10.4          4.6  virginicavirginica
146          12.6          5.0          10.0          3.8  virginicavirginica
147          13.0          6.0          10.4          4.0  virginicavirginica
148          11.6          6.8          10.8          4.6  virginicavirginica
149          11.8          6.0          10.2          3.6  virginicavirginica

[150 rows x 5 columns]

In [82]:
iris.apply(lambda x:x+x)

     sepal_length  sepal_width  petal_length  petal_width             species
0            10.2          7.0           2.8          0.4        setosasetosa
1             9.8          6.0           2.8          0.4        setosasetosa
2             9.4          6.4           2.6          0.4        setosasetosa
3             9.2          6.2           3.0          0.4        setosasetosa
4            10.0          7.2           2.8          0.4        setosasetosa
..            ...          ...           ...          ...                 ...
145          13.4          6.0          10.4          4.6  virginicavirginica
146          12.6          5.0          10.0          3.8  virginicavirginica
147          13.0          6.0          10.4          4.0  virginicavirginica
148          12.4          6.8          10.8          4.6  virginicavirginica
149          11.8          6.0          10.2          3.6  virginicavirginica

[150 rows x 5 columns]

### grouping data together

In [83]:
iris.aggregate('min')

sepal_length       4.3
sepal_width        2.0
petal_length       1.0
petal_width        0.1
species         setosa
dtype: object

In [84]:
iris.aggregate(['min', 'max', 'mean', 'median'])

        sepal_length  sepal_width  petal_length  petal_width    species
min         4.300000        2.000      1.000000     0.100000     setosa
max         7.900000        4.400      6.900000     2.500000  virginica
mean        5.843333        3.054      3.758667     1.198667        NaN
median      5.800000        3.000      4.350000     1.300000        NaN

In [85]:
groupby=iris.groupby('species')

In [86]:
groupby

In [87]:
groupby.min

In [88]:
groupby.min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [6]:
import warnings
warnings.filterwarnings('ignore')

## handling missing data

In [23]:
iris=pd.read_csv('./iris.csv')

In [26]:
nan_idx=np.random.randint(0,150,20)
print(nan_idx)
iris['sepal_length'][nan_idx]=np.nan

[139 148   2 118  48  98  30  99 124  95  61  49  14  77 126  17 126 139
  37 145]

In [27]:
iris['sepal_length']

0      5.1
1      4.9
2      NaN
3      4.6
4      5.0
      ...
145    NaN
146    6.3
147    6.5
148    NaN
149    5.9
Name: sepal_length, Length: 150, dtype: float64

In [28]:
iris.isna()

     sepal_length  sepal_width  petal_length  petal_width  species
0           False        False         False        False    False
1           False        False         False        False    False
2            True        False         False        False    False
3           False        False         False        False    False
4           False        False         False        False    False
..            ...          ...           ...          ...      ...
145          True        False         False        False    False
146         False        False         False        False    False
147         False        False         False        False    False
148          True        False         False        False    False
149         False        False         False        False    False

[150 rows x 5 columns]

In [29]:
iris.isna().sum()

sepal_length    18
sepal_width      0
petal_length     0
petal_width      0
species          0
dtype: int64

In [22]:
# iris.dropna()

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
142           5.8          2.7           5.1          1.9  virginica
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
149           5.9          3.0           5.1          1.8  virginica

[113 rows x 5 columns]

In [30]:
iris['sepal_length'].fillna(value="FillThis")[:50]

0          5.1
1          4.9
2     FillThis
3          4.6
4          5.0
5          5.4
6          4.6
7          5.0
8          4.4
9          4.9
10         5.4
11         4.8
12         4.8
13         4.3
14    FillThis
15         5.7
16         5.4
17    FillThis
18         5.7
19         5.1
20         5.4
21         5.1
22         4.6
23         5.1
24         4.8
25         5.0
26         5.0
27         5.2
28         5.2
29         4.7
30    FillThis
31         5.4
32         5.2
33         5.5
34         4.9
35         5.0
36         5.5
37    FillThis
38         4.4
39         5.1
40         5.0
41         4.5
42         4.4
43         5.0
44         5.1
45         4.8
46         5.1
47         4.6
48    FillThis
49    FillThis
Name: sepal_length, dtype: object

In [31]:
iris['sepal_length']=iris['sepal_length'].fillna(value=round(iris['sepal_length'].mean(),1))

In [32]:
iris['sepal_length'][:50]

0     5.1
1     4.9
2     5.8
3     4.6
4     5.0
5     5.4
6     4.6
7     5.0
8     4.4
9     4.9
10    5.4
11    4.8
12    4.8
13    4.3
14    5.8
15    5.7
16    5.4
17    5.8
18    5.7
19    5.1
20    5.4
21    5.1
22    4.6
23    5.1
24    4.8
25    5.0
26    5.0
27    5.2
28    5.2
29    4.7
30    5.8
31    5.4
32    5.2
33    5.5
34    4.9
35    5.0
36    5.5
37    5.8
38    4.4
39    5.1
40    5.0
41    4.5
42    4.4
43    5.0
44    5.1
45    4.8
46    5.1
47    4.6
48    5.8
49    5.8
Name: sepal_length, dtype: float64

## concat/merge dataframes